Revit 2027 API
FailuresAccessor.DeleteAllWarnings Method
 Deletes all FailureMessages of severity "Warning" currently posted in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteAllWarnings()
Public Sub DeleteAllWarnings
public:
void DeleteAllWarnings()
member DeleteAllWarnings : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 Warnings are deleted immediately and will not be accessible by any further failures processing. Any accessors for these failure messages become invalid.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace